1ques:

Given a sample list, tuple and a set with elements as numbers from 1-10. Convert each
 of the data types into a pandas series. Create a separate list of index values for the
 series.

In [2]:
import pandas as pd

l = [1,2,3,4,5,6,7,8,9,10]
t = (1,2,3,4,5,6,7,8,9,10)

i = ['a','b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

s1 =pd.Series(l , index = i)
s2 = pd.Series(t, index = i)
print(s1)
print(s2)

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64
a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64

In [3]:
set1 = {1,2,3,4,5,6,7,8,9,10}
s3 = pd.Series(list(set1))
s3

# set is  unordered, unindexed , unique - so, convert to list first

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

2ques:

 Create a python dictionary with three key value pairs. Keep the keys as the first names,
 and the respective last names as values in the dictionary. Use the dictionary to create a
 pandas series.

In [5]:
# 4mins
mydict = {"a": "b", "c": "d", "e": "f"}
s4 = pd.Series(mydict)
print(s4)

a    b
c    d
e    f
dtype: object

In [6]:
dic = {
    'Alpha' : ['Beta'],
    'Jon' : ['Doe'],
    'Charlee' : ['Smith']
}
df = pd.DataFrame(dic)
df

  Alpha  Jon Charlee
0  Beta  Doe   Smith

In [7]:
import pandas as pd
# Create the dictionary
name_dict = {
    "Alice": "Smith",
    "Bob": "Johnson",
    "Charlie": "Williams"
}
name_series = pd.Series(name_dict)
print(name_series)

Alice         Smith
Bob         Johnson
Charlie    Williams
dtype: object

In [8]:
nameDict = {'Thomas':'Edison' ,'Isaac': 'Newton','Graham':'Bell'}
print(nameDict)
nameSeries = pd.Series(nameDict)
print(nameSeries)

{'Thomas': 'Edison', 'Isaac': 'Newton', 'Graham': 'Bell'}
Thomas    Edison
Isaac     Newton
Graham      Bell
dtype: object

In [9]:
df = {
    'samir': 'shukla',
    'prosenjit': 'naskar',
    'chandu': 'kumar'
}
name_series = pd.Series(df)
print(name_series)

samir        shukla
prosenjit    naskar
chandu        kumar
dtype: object

3ques:

Create a pandas series, with the elements as numbers from 1-10. Use the index values
 starting from 0-10. For the above series:
 a. Convert it to a list.

 b. Convert it to a dictionary.

 c. Convert it to a tuple.

 d. Convert it to a set.

In [11]:
s5 = pd.Series(range(1, 11))
s5

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [12]:
# convert to a list
l = list(s5)
l

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [13]:
# convert to dict
d =s5.to_dict()
d

{0: 1, 1: 2, 2: 3, 3: 4, 4: 5, 5: 6, 6: 7, 7: 8, 8: 9, 9: 10}

In [14]:
# convert to tuple
t = tuple(s5)
t

(1, 2, 3, 4, 5, 6, 7, 8, 9, 10)

In [15]:
# convert to set
s = set(s5)
s

{1, 2, 3, 4, 5, 6, 7, 8, 9, 10}

Create a sample pandas series with x integer elements. Perform the following operations
 on the same:
 a. Print the first 5 elements of the series

 b. Print the last 5 elements of the series

 c. Insert an integer value ‘50’ at the index 5.

 d. Update the last element in the series with the value 100.

 e. Delete the first element from the series.

 Note: The index values must not be affected by the operations and should be uniform for
 the series after the last operation.

In [17]:
# 5 mins
series1 =  pd.Series(range(1, 11), index=range(10))
print(series1)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [18]:
print('first 5 elements')
print(series1.head(5))

first 5 elements
0    1
1    2
2    3
3    4
4    5
dtype: int64

In [19]:
print('last 5 elements')
print(series1.tail(5))

last 5 elements
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [20]:
print('insert 50 at index 5')
series1[5] = 50
print(series1)

insert 50 at index 5
0     1
1     2
2     3
3     4
4     5
5    50
6     7
7     8
8     9
9    10
dtype: int64

In [21]:
print('update last element with 100')
series1[len(series1)-1] = 100
print(series1)

update last element with 100
0      1
1      2
2      3
3      4
4      5
5     50
6      7
7      8
8      9
9    100
dtype: int64

In [22]:
print('delete first element')
series1 = series1.drop(0).reset_index(drop = True)
print(series1)

delete first element
0      2
1      3
2      4
3      5
4     50
5      7
6      8
7      9
8    100
dtype: int64

In [23]:
d_top5 = series1.head()
d_top5

0     2
1     3
2     4
3     5
4    50
dtype: int64

In [24]:
d_bot5 = series1.tail()
d_bot5

4     50
5      7
6      8
7      9
8    100
dtype: int64

In [25]:
s = pd.Series(range(1, 11), index=range(10))
print(s)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [26]:
print(s.head(5))

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [27]:
print(s.tail(5))

5     6
6     7
7     8
8     9
9    10
dtype: int64

In [28]:
series = pd.concat([s[:5], pd.Series([50], index=[5]), s[5:]]).reset_index(drop=True)
print(series)

0      1
1      2
2      3
3      4
4      5
5     50
6      6
7      7
8      8
9      9
10    10
dtype: int64

In [29]:
series.iloc[[2,5,7]]

2     3
5    50
7     7
dtype: int64

In [30]:
series.iloc[-1] = 100
print(series)
series = series.iloc[1:]
series.index -= 1  # reset index
print(series)

0       1
1       2
2       3
3       4
4       5
5      50
6       6
7       7
8       8
9       9
10    100
dtype: int64
0      2
1      3
2      4
3      5
4     50
5      6
6      7
7      8
8      9
9    100
dtype: int64

In [31]:
s = pd.Series([1,2,3,4,5,6,7,8,9,10])

#
s.head()

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [32]:
s.tail(6)

4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [33]:
s[5] = 50
s

0     1
1     2
2     3
3     4
4     5
5    50
6     7
7     8
8     9
9    10
dtype: int64

In [34]:
s[9] = 100
s

0      1
1      2
2      3
3      4
4      5
5     50
6      7
7      8
8      9
9    100
dtype: int64

In [35]:
#s =s.drop(0)
#s


s = s.reset_index(drop = True)
s

0      1
1      2
2      3
3      4
4      5
5     50
6      7
7      8
8      9
9    100
dtype: int64

In [36]:
s[10]= 120
s

0       1
1       2
2       3
3       4
4       5
5      50
6       7
7       8
8       9
9     100
10    120
dtype: int64

In [37]:
s.loc[3:6]

3     4
4     5
5    50
6     7
dtype: int64

In [38]:
s.iloc[3:6]

3     4
4     5
5    50
dtype: int64

In [39]:
# loc and iloc
s.loc[3] = 140
s

0       1
1       2
2       3
3     140
4       5
5      50
6       7
7       8
8       9
9     100
10    120
dtype: int64

In [40]:
"""import pandas as pd
series = pd.Series([10, 20, 30], index=['A', 'B', 'C'])
new_series = series.append(pd.Series([40], index=['D']))
print(new_series)"""

"import pandas as pd\nseries = pd.Series([10, 20, 30], index=['A', 'B', 'C'])\nnew_series = series.append(pd.Series([40], index=['D']))\nprint(new_series)"

In [41]:
# For a given pandas series obtained in the 4th step. Write a sample code to find the
 #element 100 in the series.
list1 = list(s)
print("Position of 100 : " , list1.index(100))

Position of 100 :  9

In [42]:
if 100  in s.values:
  print("100 is present")
else:
  print("not present")

100 is present

In [43]:
dt = s[s == 100]
dt

9    100
dtype: int64

In [44]:
s[s == 100]

9    100
dtype: int64

 6. For the given series A and B, perform concatenation on the same.
 series_A = pd.Series([1,2,3,4,5])
 series_B = pd.Series([6,7,8,9,10])



 7. Using loops in python, print all the elements within a pandas series.
 Sample = pd.Series([1,2,3,4,5,6,7,8,9,10])

In [46]:
# 5 mins
series_A = pd.Series([1,2,3,4,5])
series_B = pd.Series([6,7,8,9,10])
concat = pd.concat([series_A, series_B])
concat

0     1
1     2
2     3
3     4
4     5
0     6
1     7
2     8
3     9
4    10
dtype: int64

In [47]:
series_A = pd.Series([1,2,3,4,5])
series_B = pd.Series([6,7,8,9,10])
series_C = pd.concat([series_A, series_B]).reset_index(drop=True)
print(series_C)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [48]:
Sample = pd.Series([1,2,3,4,5,6,7,8,9,10])
for s in Sample:
  print(s)

1
2
3
4
5
6
7
8
9
10

In [50]:
Sample = pd.Series([1,2,3,4,5,6,7,8,9,10])
for i in Sample:
    print(i)

1
2
3
4
5
6
7
8
9
10

In [51]:
s = pd.concat([series_A, series_B]).reset_index(drop=True)
print(s)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [52]:
Sample = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])

# Using a for loop
for value in Sample:
    print(value)

1
2
3
4
5
6
7
8
9
10

In [53]:
series_A = pd.Series([1, 2, 3, 4, 5])
series_B = pd.Series([6, 7, 8, 9, 10])
series_c = pd.concat([series_A, series_B])
print(series_c)

0     1
1     2
2     3
3     4
4     5
0     6
1     7
2     8
3     9
4    10
dtype: int64

In [54]:
s1 = pd.Series([1, 2, 3, 4, 5])
s2 = pd.Series([6, 7, 8, 9, 10])
concat_s=pd.concat([s1,s2])
concat_s

0     1
1     2
2     3
3     4
4     5
0     6
1     7
2     8
3     9
4    10
dtype: int64

 For a given nested list and a sample dictionary, create two data frames using pandas.

 List = [['AA','BB','CC'], ['DD','EE','FF'], ['GG','HH','II']]
 Dictionary = { 'Kris': ['Jordan', 12,22],'Memphis': ['Depay', 23, 24]}

In [56]:

List = [['AA','BB','CC'], ['DD','EE','FF'], ['GG','HH','II']]
Dictionary = { 'Kris': ['Jordan', 12,22],'Memphis': ['Depay', 23, 24]}

DF1 = pd.DataFrame(List, columns =['x', 'y', 'z'])
df2 = pd.DataFrame(Dictionary, columns = ['Names', 'AGE'])





print(DF1)
print(df2)

    x   y   z
0  AA  BB  CC
1  DD  EE  FF
2  GG  HH  II
Empty DataFrame
Columns: [Names, AGE]
Index: []

In [57]:
Dictionary = { 'Name': ['Jordan', 12,22],'name2': ['Depay', 23, 24]}
df2 = pd.DataFrame(Dictionary, )

df2

     Name  name2
0  Jordan  Depay
1      12     23
2      22     24

In [58]:
Dictionary = { 'Name': ['Jordan', 'Depay'],'name2': [12, 23]}

df = pd.DataFrame(Dictionary)
df.columns = ['Name', 'Age']
print(df)

     Name  Age
0  Jordan   12
1   Depay   23

9ques:

Create a pandas Dataframe  with two columns = [‘Name’, ‘Age’]. Perform the following
 operations on the same.
 a. Print the first 3 rows of the Data Frame .

 b. Print the rows that have the age greater than 15.

 c. Insert 5 imaginary names and ages as values to the pandas Data Frame .

 d. Update the 5th row so that the name = john and age=56.

 e. Delete the first row from the Data Frame .

In [60]:
# 5 mins
df = pd.DataFrame({
    'Name' : ['Alpha', 'Beta', 'Gamma', 'Delta', 'Epsilon'],
    'Age' : [25, 30, 35, 40, 45]
})
print(df)
print('first 3 rows')
print(df.head(3))
print('rows that have age greater than 15')
print(df[df['Age'] > 15])
print('insert 5 imaginary names and ages as values to the pandas Data Frame')
df.loc[5] = ['Zeta', 50]
df.loc[6] = ['Eta', 55]
df.loc[7] = ['Theta', 60]
df.loc[8] = ['Iota', 65]
df.loc[9] = ['Kappa', 70]
print(df)
print('update 5th row so that the name = john and age=56')
df.loc[5] = ['John', 56]
print(df)

      Name  Age
0    Alpha   25
1     Beta   30
2    Gamma   35
3    Delta   40
4  Epsilon   45
first 3 rows
    Name  Age
0  Alpha   25
1   Beta   30
2  Gamma   35
rows that have age greater than 15
      Name  Age
0    Alpha   25
1     Beta   30
2    Gamma   35
3    Delta   40
4  Epsilon   45
insert 5 imaginary names and ages as values to the pandas Data Frame
      Name  Age
0    Alpha   25
1     Beta   30
2    Gamma   35
3    Delta   40
4  Epsilon   45
5     Zeta   50
6      Eta   55
7    Theta   60
8     Iota   65
9    Kappa   70
update 5th row so that the name = john and age=56
      Name  Age
0    Alpha   25
1     Beta   30
2    Gamma   35
3    Delta   40
4  Epsilon   45
5     John   56
6      Eta   55
7    Theta   60
8     Iota   65
9    Kappa   70

In [61]:
name = ['Aditya','Ashish','Nitya', 'Gaurav','Raj']
age = [20, 30, 40, 35, 33]
#a)
df = pd.DataFrame({'Name':name, 'Age':age})
df
#b)
df[df['Age'] > 15]

     Name  Age
0  Aditya   20
1  Ashish   30
2   Nitya   40
3  Gaurav   35
4     Raj   33

In [62]:
import pandas as pd
data = {
    'Name': ['Rita', 'Rahul', 'Santanu', 'Pritha'],
    'Age': [5, 30, 35, 40]
}

df = pd.DataFrame(data)
df

      Name  Age
0     Rita    5
1    Rahul   30
2  Santanu   35
3   Pritha   40

In [63]:
data = {
    'Name': ['samir', 'kumar', 'shukla', 'arko', 'subhasis'],
    'Age': [10, 12, 14, 16, 18]
}
df = pd.DataFrame(data)
print(df)
print(df.head(3))
print(df[df['Age'] > 15])
new_data = {
    'Name': ['A1', 'b2', 'c3', 'd4', 'e5'],
    'Age': [20, 22, 24, 26, 28]
}
new_df = pd.DataFrame(new_data)
df = pd.concat([df, new_df], ignore_index=True)
print(df)
df.loc[4, 'Name'] = 'f'
df.loc[4, 'Age'] = 82
print(df)
df = df.iloc[1:].reset_index(drop=True)
print(df)

       Name  Age
0     samir   10
1     kumar   12
2    shukla   14
3      arko   16
4  subhasis   18
     Name  Age
0   samir   10
1   kumar   12
2  shukla   14
       Name  Age
3      arko   16
4  subhasis   18
       Name  Age
0     samir   10
1     kumar   12
2    shukla   14
3      arko   16
4  subhasis   18
5        A1   20
6        b2   22
7        c3   24
8        d4   26
9        e5   28
     Name  Age
0   samir   10
1   kumar   12
2  shukla   14
3    arko   16
4       f   82
5      A1   20
6      b2   22
7      c3   24
8      d4   26
9      e5   28
     Name  Age
0   kumar   12
1  shukla   14
2    arko   16
3       f   82
4      A1   20
5      b2   22
6      c3   24
7      d4   26
8      e5   28

In [64]:
import pandas as pd

data = {
    'Name': ['Aarav', 'Vivaan', 'Aditya'],
    'Age': [12, 16, 14]
}

df = pd.DataFrame(data)

# a. Print the first 3 rows of the Data Frame
print(df.head(3))

# b. Print the rows that have the age greater than 15
print(df[df['Age'] > 15])

# c. Insert 5 imaginary names and ages as values to the pandas Data Frame
new_data = {
    'Name': ['Riya', 'Anaya', 'Kabir', 'Ishaan', 'Nisha'],
    'Age': [20, 18, 22, 19, 21]
}
new_df = pd.DataFrame(new_data)
df = pd.concat([df, new_df], ignore_index=True)

# d. Update the 5th row so that the name = john and age=56
df.loc[4] = ['john', 56]

# e. Delete the first row from the Data Frame
df = df.drop(index=0).reset_index(drop=True)

print(df)

     Name  Age
0   Aarav   12
1  Vivaan   16
2  Aditya   14
     Name  Age
1  Vivaan   16
     Name  Age
0  Vivaan   16
1  Aditya   14
2    Riya   20
3    john   56
4   Kabir   22
5  Ishaan   19
6   Nisha   21

In [65]:
data = {
    'Name': ['Amit', 'Priya', 'Rahul'],
    'Age': [25, 30, 35]
}
df = pd.DataFrame(data)
print(df)
print(df.head(3))
print(df[df['Age'] > 15])
new_data = {
    'Name': ['Sunita', 'Neha', 'Vikram', 'Anjali', 'Roopneet'],
    'Age': [22, 28, 31, 27, 24]
}
new_df = pd.DataFrame(new_data)
df = pd.concat([df, new_df], ignore_index=True)
print(df)
df.loc[4, 'Name'] = 'John'
df.loc[4, 'Age'] = 56
print(df)
df = df.drop(index=0).reset_index(drop=True)

    Name  Age
0   Amit   25
1  Priya   30
2  Rahul   35
    Name  Age
0   Amit   25
1  Priya   30
2  Rahul   35
    Name  Age
0   Amit   25
1  Priya   30
2  Rahul   35
       Name  Age
0      Amit   25
1     Priya   30
2     Rahul   35
3    Sunita   22
4      Neha   28
5    Vikram   31
6    Anjali   27
7  Roopneet   24
       Name  Age
0      Amit   25
1     Priya   30
2     Rahul   35
3    Sunita   22
4      John   56
5    Vikram   31
6    Anjali   27
7  Roopneet   24

In [66]:
import pandas as pd
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
        'Age': [12, 18, 15, 20, 10]}
df = pd.DataFrame(data)
print("First 3 rows:\n", df.head(3))
print("\nRows with age > 15:\n", df[df['Age'] > 15])
new_data = {'Name': ['John', 'Jane', 'Mike', 'Sarah', 'Tom'],
            'Age': [25, 30, 17, 22, 28]}
new_df = pd.DataFrame(new_data)
df = pd.concat([df, new_df], ignore_index=True)
df.loc[4, 'Name'] = 'john'
df.loc[4, 'Age'] = 56

First 3 rows:
       Name  Age
0    Alice   12
1      Bob   18
2  Charlie   15

Rows with age > 15:
     Name  Age
1    Bob   18
3  David   20

In [67]:
import pandas as pd
data = {
    'Name': ['Rita', 'Rahul', 'Santanu', 'Pritha'],
    'Age': [5, 30, 35, 40]
}
data1= {
    'Name': ['Zara', 'Leo', 'Mira', 'Niko', 'Ayla'],
    'Age': [22, 28, 31, 26, 24]
}

df=pd.DataFrame(data)
df1=pd.DataFrame(data1)
df2 = pd.concat([df, df1])

In [68]:
data={'name':['alice','bob','charlie','david','eva'],
      'age':[20,12,18,22,9]}
df = pd.DataFrame(data)
print(df)

      name  age
0    alice   20
1      bob   12
2  charlie   18
3    david   22
4      eva    9

In [69]:
data = [['akash', 18], ['neck', 20], ['joey', 29], ['ishita', 20]]

df3 = pd.DataFrame(data, columns =['NAME', 'AGE'])
df3

     NAME  AGE
0   akash   18
1    neck   20
2    joey   29
3  ishita   20

In [70]:
df3.head(3)

    NAME  AGE
0  akash   18
1   neck   20
2   joey   29

In [71]:
df3[df3.AGE> 15]

     NAME  AGE
0   akash   18
1    neck   20
2    joey   29
3  ishita   20

In [72]:
data = {
    'NAME': ['priya', 'payal', 'kajol'],
    'AGE': [20, 39, 30]
}
df2=pd.DataFrame(data)

In [73]:
data = [['akash', 18], ['neck', 20], ['joey', 29], ['ishita', 20]]

df3 = pd.DataFrame(data, columns =['NAME', 'AGE'])
df3

     NAME  AGE
0   akash   18
1    neck   20
2    joey   29
3  ishita   20

In [74]:
df4 =pd.concat([df3, df2], ignore_index = True)
df4

     NAME  AGE
0   akash   18
1    neck   20
2    joey   29
3  ishita   20
4   priya   20
5   payal   39
6   kajol   30

In [75]:
df4.loc[5] = ['ash', 21]
df4

     NAME  AGE
0   akash   18
1    neck   20
2    joey   29
3  ishita   20
4   priya   20
5     ash   21
6   kajol   30

In [76]:
df4.drop(0)

     NAME  AGE
1    neck   20
2    joey   29
3  ishita   20
4   priya   20
5     ash   21
6   kajol   30

10ques:
 For the Data Frame  obtained from step 9, convert the same to a list and a dictionary
 respectively.

In [78]:
print('Converting to dict: \n', df4.to_dict())
print('Converting to list: \n', df4.values.tolist())

Converting to dict:
 {'NAME': {0: 'akash', 1: 'neck', 2: 'joey', 3: 'ishita', 4: 'priya', 5: 'ash', 6: 'kajol'}, 'AGE': {0: 18, 1: 20, 2: 29, 3: 20, 4: 20, 5: 21, 6: 30}}
Converting to list:
 [['akash', 18], ['neck', 20], ['joey', 29], ['ishita', 20], ['priya', 20], ['ash', 21], ['kajol', 30]]

In [79]:
mylist = df4.values.tolist()
mydict = df4.to_dict()
print(mylist)
print()
print(mydict)

[['akash', 18], ['neck', 20], ['joey', 29], ['ishita', 20], ['priya', 20], ['ash', 21], ['kajol', 30]]

{'NAME': {0: 'akash', 1: 'neck', 2: 'joey', 3: 'ishita', 4: 'priya', 5: 'ash', 6: 'kajol'}, 'AGE': {0: 18, 1: 20, 2: 29, 3: 20, 4: 20, 5: 21, 6: 30}}

In [80]:
name = ['Aditya','Ashish','Nitya', 'Gaurav','Raj']
age = [20, 30, 40, 35, 33]
df = pd.DataFrame({'Name':name, 'Age':age})
df
lst = df.values.tolist()
print(lst)
dic = df.to_dict()
print(dic)

[['Aditya', 20], ['Ashish', 30], ['Nitya', 40], ['Gaurav', 35], ['Raj', 33]]
{'Name': {0: 'Aditya', 1: 'Ashish', 2: 'Nitya', 3: 'Gaurav', 4: 'Raj'}, 'Age': {0: 20, 1: 30, 2: 40, 3: 35, 4: 33}}

Create two separate Data Frame s A and B, and perform the following operations on
 them.
 a. Concatenate the two Data Frame s to a new Data Frame  C.
 b. Split the Data Frame  C row wise.
 c. Split the Data Frame column wise based on a condition. For example - columns
 values greater than 10, column values less than 10, etc

In [82]:
a = pd.DataFrame([1,2,3,4,5])
b = pd.DataFrame([11,12,13,14,15])

In [83]:
c = pd.concat([a,b], ignore_index = True)
c

    0
0   1
1   2
2   3
3   4
4   5
5  11
6  12
7  13
8  14
9  15

In [84]:
df4 = c.iloc[: 5, :]
df4

   0
0  1
1  2
2  3
3  4
4  5

In [85]:
df5 = c.iloc[5: , :]
df5

    0
5  11
6  12
7  13
8  14
9  15

In [86]:
g = c[c[0]<10]
g

   0
0  1
1  2
2  3
3  4
4  5

In [87]:
A = pd.DataFrame({
    'Name' : ['Alpha', 'Beta', 'Gamma', 'Delta', 'Epsilon'],
    'Age' : [25, 30, 10, 40,55]
})
B = pd.DataFrame({
    'Name' : ['Zeta', 'Eta', 'Theta', 'Iota', 'Kappa'],
    'Age' : [50, 10, 60, 65, 70]
})
C = pd.concat([A, B]).reset_index(drop=True)
print(C)
print('Spliting dataframe row wise:')
C1 = C.iloc[:5, :]
C2 = C.iloc[5:, :]
print(C1)
print(C2)
print('Spliting dataframe column wise:')
C3 = C[C['Age'] > 10]
C4 = C[C['Age'] <= 10]
print('Spliting dataframe column wise: more than 10')
print(C3)
print('Spliting dataframe column wise: more less/equal 10')
print(C4)

      Name  Age
0    Alpha   25
1     Beta   30
2    Gamma   10
3    Delta   40
4  Epsilon   55
5     Zeta   50
6      Eta   10
7    Theta   60
8     Iota   65
9    Kappa   70
Spliting dataframe row wise:
      Name  Age
0    Alpha   25
1     Beta   30
2    Gamma   10
3    Delta   40
4  Epsilon   55
    Name  Age
5   Zeta   50
6    Eta   10
7  Theta   60
8   Iota   65
9  Kappa   70
Spliting dataframe column wise:
Spliting dataframe column wise: more than 10
      Name  Age
0    Alpha   25
1     Beta   30
3    Delta   40
4  Epsilon   55
5     Zeta   50
7    Theta   60
8     Iota   65
9    Kappa   70
Spliting dataframe column wise: more less/equal 10
    Name  Age
2  Gamma   10
6    Eta   10

In [171]:
import numpy as np
a = pd.DataFrame({'A':[1,2,3,4,5], 'B':[6,7,8,9,10]})
b = pd.DataFrame({'A':[11,12,13,14,15], 'B':[16,17,18,19,20]})

In [173]:
#a)
c = pd.concat([a,b])
print('a. Concatenate the two Data Frame s to a new Data Frame C.')
print(c)

a. Concatenate the two Data Frame s to a new Data Frame C.
    A   B
0   1   6
1   2   7
2   3   8
3   4   9
4   5  10
0  11  16
1  12  17
2  13  18
3  14  19
4  15  20

In [183]:
#b)
splt_r = np.array_split(c, 2)
print('b. Split the Data Frame C row wise.')
print(splt_r)

b. Split the Data Frame C row wise.
[   A   B
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10,     A   B
0  11  16
1  12  17
2  13  18
3  14  19
4  15  20]

C:\ProgramData\anaconda3\Lib\site-packages\numpy\core\fromnumeric.py:59: FutureWarning: 'DataFrame.swapaxes' is deprecated and will be removed in a future version. Please use 'DataFrame.transpose' instead.
  return bound(*args, **kwds)

In [185]:
#c)
splt_c = np.array_split(c, 2, axis = 1)
print('c. Split the Data Frame column wise based on a condition')
print(splt_c)

c. Split the Data Frame column wise based on a condition
[    A
0   1
1   2
2   3
3   4
4   5
0  11
1  12
2  13
3  14
4  15,     B
0   6
1   7
2   8
3   9
4  10
0  16
1  17
2  18
3  19
4  20]

C:\ProgramData\anaconda3\Lib\site-packages\numpy\core\fromnumeric.py:59: FutureWarning: 'DataFrame.swapaxes' is deprecated and will be removed in a future version. Please use 'DataFrame.transpose' instead.
  return bound(*args, **kwds)

Create a Data Frame with columns Name and Age. Perform the following operations.
 a. Write a sample code to search for the Name/Names where Age is 20.

 b. Sort the Data Frame in ascending order of ages.

 c. Using Python loops, print the ages from the data frame and store it in a set

In [90]:
# 5mins
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 20, 20, 30, 22]
}
df = pd.DataFrame(data)
print(df)

names_age_20 = df[df['Age'] == 20]['Name']
print(names_age_20)

df_sorted = df.sort_values(by='Age')
print(df_sorted)

ages_set = set()
for age in df['Age']:
    print(age)
    ages_set.add(age)

print("\nSet of ages:", ages_set)

      Name  Age
0    Alice   25
1      Bob   20
2  Charlie   20
3    David   30
4      Eva   22
1        Bob
2    Charlie
Name: Name, dtype: object
      Name  Age
1      Bob   20
2  Charlie   20
4      Eva   22
0    Alice   25
3    David   30
25
20
20
30
22

Set of ages: {25, 20, 30, 22}

In [91]:
person = pd.DataFrame({
    'Name' : ['Alpha', 'Beta', 'Gamma', 'Delta', 'Epsilon'],
    'Age' : [25, 30, 20, 40, 20]
})
print(person)
print('Search for the Name/Names where Age is 20')
print(person[person['Age'] == 20])
print('Sort the Data Frame in ascending order of ages')
print(person.sort_values(by='Age', ascending=True))
print('Using Python loops, print the ages from the data frame and store it in a set')
set1 = set()
for age in person['Age']:
  set1.add(age)
print(set1)

      Name  Age
0    Alpha   25
1     Beta   30
2    Gamma   20
3    Delta   40
4  Epsilon   20
Search for the Name/Names where Age is 20
      Name  Age
2    Gamma   20
4  Epsilon   20
Sort the Data Frame in ascending order of ages
      Name  Age
2    Gamma   20
4  Epsilon   20
0    Alpha   25
1     Beta   30
3    Delta   40
Using Python loops, print the ages from the data frame and store it in a set
{40, 25, 20, 30}

In [93]:
import pandas as pd

# Create a Data Frame
data = {
    'Name': ['Aarav', 'Vivaan', 'Aditya', 'Vihaan', 'Arjun', 'Sai'],
    'Age': [20, 22, 20, 21, 23, 20]
}
df = pd.DataFrame(data)

# a. Search for the Name/Names where Age is 20
names_age_20 = df[df['Age'] == 20]['Name'].tolist()
print(names_age_20)

# b. Sort the Data Frame in ascending order of ages
sorted_df = df.sort_values(by='Age')
print(sorted_df)

# c. Using Python loops, print the ages from the data frame and store it in a set
ages_set = set()
for age in df['Age']:
    print(age)
    ages_set.add(age)

['Aarav', 'Aditya', 'Sai']
     Name  Age
0   Aarav   20
2  Aditya   20
5     Sai   20
3  Vihaan   21
1  Vivaan   22
4   Arjun   23
20
22
20
21
23
20

In [94]:
df_people = pd.DataFrame({'Name': ['Vivek', 'Nydeth', 'Anthrax', 'Jubilee', 'Kage'], 'Age': [20, 25, 20, 22, 18]})
print(df_people)
age_20_names = df_people[df_people['Age'] == 20]['Name']
print(age_20_names)
df_sorted = df_people.sort_values(by='Age')
print(df_sorted)
age_set = set()
for age in df_people['Age']:
    age_set.add(age)

print(age_set)

      Name  Age
0    Vivek   20
1   Nydeth   25
2  Anthrax   20
3  Jubilee   22
4     Kage   18
0      Vivek
2    Anthrax
Name: Name, dtype: object
      Name  Age
4     Kage   18
0    Vivek   20
2  Anthrax   20
3  Jubilee   22
1   Nydeth   25
{25, 18, 20, 22}

In [95]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Emily', 'Frank'],
    'Age': [20, 25, 20, 30, 20, 35]
}
df = pd.DataFrame(data)
print(df)
names = df.loc[df['Age'] == 20, 'Name'].tolist()
print(names)
df_sorted = df.sort_values(by='Age')
print(df_sorted)

      Name  Age
0    Alice   20
1      Bob   25
2  Charlie   20
3    David   30
4    Emily   20
5    Frank   35
['Alice', 'Charlie', 'Emily']
      Name  Age
0    Alice   20
2  Charlie   20
4    Emily   20
1      Bob   25
3    David   30
5    Frank   35

In [96]:
import pandas as pd

data = {
    'Name': ['Rita', 'Ramesh', 'Viru', 'Dalia', 'Eva', 'Santanu'],
    'Age': [20, 25, 20, 30, 22, 25]
}

df = pd.DataFrame(data)
df

      Name  Age
0     Rita   20
1   Ramesh   25
2     Viru   20
3    Dalia   30
4      Eva   22
5  Santanu   25

In [97]:
df3

     NAME  AGE
0   akash   18
1    neck   20
2    joey   29
3  ishita   20

In [98]:
df3[df3['AGE']== 20]

     NAME  AGE
1    neck   20
3  ishita   20

In [99]:
df3.sort_values(by = 'AGE')

     NAME  AGE
0   akash   18
1    neck   20
3  ishita   20
2    joey   29

In [100]:
age_set = set()
for age in df3['AGE']:
  print(age)
  age_set.add(age)

print(age_set)

18
20
29
20
{18, 20, 29}